import sys

n = int(input())
if n % 2:
    print('odd')
    sys.exit()
print('even')

"""
这里展示了一点不一样的东西，首先是我在1.2.9里面请求大家别忘了的性质。
你可以这样理解：if本质上只有两种状态 if True 和 if False。如果是前者就执行后面的代码块，如果是后者就不执行
if后面无论跟什么，都是先强行转换成bool型。所以if [表达式] 相当于先 if bool([表达式])，看到底是True还是False。
这样解释是为了让你更好理解，这并不是很精确，但大部分情况下可以这样理解。所以更具体的等你遇到例外再说吧。
所以回忆一下1.2.9，想必你能对这种实现方法有一些理解。
"""
"""
另一个有意思的东西是，除了写else语句，你还可以用控制语句sys.exit（本质上相当于结束程序）来实现一样的效果。
我建议大家不要太轻视这个思想，这不是只用来炫技的做法，我相信以后你们会用到的（虽然可能是以别的形式用到，比如break，continue，pass……）。
"""